<?php

/**
 * Properties Lexicon Entries
 * Sorted by key, alphabetically
 *
 * @package minishop2
 * @subpackage lexicon
 */

$_lang['ms2_prop_class'] = 'Імя класа для выбару. Па змаўчанні — "msProduct".';
$_lang['ms2_prop_depth'] = 'Глыбіня пошуку тавараў ад кожнага з бацькоў.';
$_lang['ms2_prop_fastMode'] = 'Калі ўключана - у чанк выніку будуць падстаўленыя толькі значэння з БД. Усе неапрацаваныя тэгі MODX, такія як фільтры, выклік сниппетов і іншыя - будуць выразаныя.';
$_lang['ms2_prop_filetype'] = 'Тып файлаў для выбару. Вы можаце выкарыстоўваць "image" для малюнкаў і пашырэнняў для іншых файлаў. Напрыклад "image, pdf, xls, doc".';
$_lang['ms2_prop_groups'] = 'Паказваць параметры толькі па выбраных групах (імя або ідэнтыфікатар катэгорыі праз коску, "0" азначае адсутнасць групы).';
$_lang['ms2_prop_hideEmpty'] = 'Схаваць параметры з пустым значэннем.';
$_lang['ms2_prop_ignoreGroups'] = 'Групы, опцыі якіх не трэба выводзіць у спісе, праз коску.';
$_lang['ms2_prop_ignoreOptions'] = 'Опцыі, якія не трэба выводзіць у спісе, праз коску';
$_lang['ms2_prop_includeContent'] = 'Выбіраць поле "content" у тавараў.';
$_lang['ms2_prop_includeTVs'] = 'Спіс TV параметраў для выбаркі, праз коску. Напрыклад: "action, time" дадуць плейсхолдеры [[+action]] і [[+time]].';
$_lang['ms2_prop_includeThumbs'] = 'Спіс памераў прэв\'ю для выбаркі, праз коску. Напрыклад: "small, medium" дадуць плейсхолдеры [[+small]] і [[+medium]]. Малюнкі павінны быць загадзя згенераваныя ў галерэі тавару.';
$_lang['ms2_prop_limit'] = 'Ліміт выбаркі вынікаў.';
$_lang['ms2_prop_link'] = 'ID сувязі тавараў, які прысвойваецца аўтаматычна пры стварэнні новай сувязі ў наладах.';
$_lang['ms2_prop_master'] = 'ID галоўнага тавару. Калі пазначаны і "master" і "slave" - выбарка пройдзе па "master".';
$_lang['ms2_prop_offset'] = 'Пропуск вынікаў з пачатку выбаркі';
$_lang['ms2_prop_onlyOptions'] = 'Выводзіць толькі гэты спіс опцый, паказаны праз коску.';
$_lang['ms2_prop_optionFilters'] = 'Фільтры па опцыях тавараў. Перадаюцца JSON радком, напрыклад, { "optionkey:>": 10}';
$_lang['ms2_prop_optionName'] = 'Імя опцыі для паказу.';
$_lang['ms2_prop_optionSelected'] = 'Імя актыўнай опцыі для ўстаноўкі атрыбуту "selected"';
$_lang['ms2_prop_options'] = 'Падзелены коскамі спіс параметраў для высновы.';
$_lang['ms2_prop_outputSeparator'] = 'Неабавязковая радок для падзелу кожнага асобніка tpl.';
$_lang['ms2_prop_parents'] = 'Спіс катэгорый, праз коску, для пошуку вынікаў. Па змаўчанні выбарка абмежаваная цякучым бацькам. Калі паставіць 0 - выбарка не абмяжоўваецца.';
$_lang['ms2_prop_product'] = 'Ідэнтыфікатар прадукту. Калі пуста, будзе выкарыстоўвацца ID гэтага дакумента.';
$_lang['ms2_prop_resources'] = 'Спіс тавараў, праз коску, для вываду ў выніках. Калі ID тавару пачынаецца з мінусу, гэты тавар выключаецца з выбаркі.';
$_lang['ms2_prop_return'] = 'Спосаб вываду вынікаў';
$_lang['ms2_prop_returnIds'] = 'Калі true, сниппет будзе вяртаць падзелены коскамі радок з ідэнтыфікатарамі вынікаў замест чанкаў.';
$_lang['ms2_prop_showDeleted'] = 'Паказаць выдаленыя тавары.';
$_lang['ms2_prop_showHidden'] = 'Паказаць тавары схаваныя ў меню.';
$_lang['ms2_prop_showLog'] = 'Паказваць дадатковую інфармацыю аб працы сниппета. Толькі для аўтарызаваных ў кантэксце "mgr".';
$_lang['ms2_prop_showUnpublished'] = 'Паказаць неапублікаваныя тавары.';
$_lang['ms2_prop_showZeroPrice'] = 'Паказаць тавар з нулявым коштам.';
$_lang['ms2_prop_slave'] = 'ID кіраванага прадукту. Калі паказана "master", гэтая опцыя будзе праігнараваная.';
$_lang['ms2_prop_sortGroups'] = 'Паказвае парадак сартавання груп опцый. Прымае як ID-шнікі, так і тэкставыя назвы гуртоў. Перадаюцца радком, напрыклад: "22,23,24" ці "Памеры,Электроніка,Рознае".';
$_lang['ms2_prop_sortOptionValues'] = 'Паказвае парадак сартавання значэнняў опцый. Перадаюцца радком, напрыклад: "size:SORT_DESC:SORT_NUMERIC:100,color:SORT_ASC:SORT_STRING"';
$_lang['ms2_prop_sortOptions'] = 'Паказвае парадак сартавання опцый. Перадаюцца радком, напрыклад: "size,color".';
$_lang['ms2_prop_sortby'] = 'Сартаванне выбаркі. Для сартавання па палях тавару трэба дадаць прэфікс "Data.", напрыклад: "&sortby=`Data.price`"';
$_lang['ms2_prop_sortbyOptions'] = 'Паказвае па якіх опцыях і як сартаваць сярод пералічанага ў &sortby. Перадаюцца радком, напрыклад, "optionkey:integer,optionkey2:datetime"';
$_lang['ms2_prop_sortdir'] = 'Кірунак сартавання';
$_lang['ms2_prop_toPlaceholder'] = 'Калі не пуста, сниппет захавае ўсе дадзеныя ў плейсхолдер з гэтым імем, замест вываду на экран.';
$_lang['ms2_prop_toSeparatePlaceholders'] = 'Калі вы пакажаце слова ў гэтым параметры, то ўсе вынікі будуць выстаўлены ў розныя плейсхолдеры, якія пачынаюцца з гэтага слова і сканчаюцца парадкавым нумарам радка, ад нуля. Напрыклад, паказаўшы ў параметры "myPl" , вы атрымаеце плейсхолдеры [[+myPl0]], [[+myPl1]] і т .д.';
$_lang['ms2_prop_tpl'] = 'Чанк афармлення для кожнага выніку.';
$_lang['ms2_prop_tplDeliveriesOuter'] = 'Чанк для афармлення блока магчымых спосабаў дастаўкі.';
$_lang['ms2_prop_tplDeliveriesRow'] = 'Чанк для апрацоўкі спосабу дастаўкі.';
$_lang['ms2_prop_tplEmpty'] = 'Чанк, які выводзіцца пры адсутнасці вынікаў.';
$_lang['ms2_prop_tplOuter'] = 'Абгортка для высновы вынікаў працы сниппета.';
$_lang['ms2_prop_tplPaymentsOuter'] = 'Чанк для афармлення блока магчымых метадаў аплаты.';
$_lang['ms2_prop_tplPaymentsRow'] = 'Чанк для афармлення аднаго метаду аплаты.';
$_lang['ms2_prop_tplRow'] = 'Чанк афармлення аднаго элемента выбаркі.';
$_lang['ms2_prop_tplSingle'] = 'Чанк афармлення адзінага выніку выбаркі.';
$_lang['ms2_prop_tplSuccess'] = 'Чанк з паведамленнем аб паспяховай працы сниппета.';
$_lang['ms2_prop_tplValue'] = 'Чанк шабланізацыі аднаго значэння для некалькіх варыянтаў';
$_lang['ms2_prop_tvPrefix'] = 'Прэфікс для уласцівасцяў TemplateVar, " tv." напрыклад. Па змаўчанні ён пусты.';
$_lang['ms2_prop_userFields'] = 'Асацыятыўны масіў палёў парадку і карыстальніка ў фармаце "order field" => "user field".';
$_lang['ms2_prop_valuesSeparator'] = 'Падзельнік для множных значэнняў опцый';
$_lang['ms2_prop_where'] = 'Радок, закадаваны ў JSON, з дадатковымі ўмовамі выбаркі.';
$_lang['ms2_prop_wrapIfEmpty'] = 'Калі true, выводзіцца абгортка, якая змешчана ў & tplWrapper, нават калі вывад пусты.';
